Revit 2024 API
MEPNetworkSegmentId Methods
The MEPNetworkSegmentId type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Verifies if this is a valid segment id.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace